{
    "Course Title": "Introduction to Old English",
    "Course Syllabus": "Course Title: LANG 101 - Introduction to Old English\nThis course serves as an introduction to Old English, the earliest form of the English language spoken and written in parts of what are now England and southern Scotland between the 5th and 11th centuries. Students will explore the linguistic, literary, and cultural aspects of Old English, gaining a foundational understanding of the language's grammar, vocabulary, and historical context.\nLearning Objectives:\nLinguistic Competence: Develop a basic understanding of Old English grammar, syntax, and vocabulary.\nLiterary Analysis: Analyze and interpret selected Old English texts, including poetry and prose.\nCultural Context: Gain insight into the historical and cultural background of the Anglo-Saxon period.\nTranslation Skills: Acquire the ability to translate simple Old English passages into modern English.\nCritical Thinking: Develop critical thinking skills through the examination of linguistic and literary concepts.\nTexts:\n\"Beowulf\" (Author unknown, translated by Seamus Heaney)\n\"A Guide to Old English\" by Bruce Mitchell and Fred C. Robinson\nSelected Old English Poems and Prose\nGrading:\nHomework: 30%\nMidterm Exam: 20%\nFinal Exam: 30%\nResearch Project: 20%\nWeekly Schedule:\nWeek 1-2: Introduction to Old English\nHistorical and cultural context\nOverview of Old English grammar and pronunciation\nWeek 3-5: Old English Vocabulary and Nouns\nVocabulary building exercises\nIntroduction to Old English nouns and noun declensions\nWeek 6-8: Verbs and Syntax\nVerbal conjugations and tenses\nSentence structure and syntax in Old English\nWeek 9-11: Literary Analysis\nClose reading of Old English poetry\nExploration of poetic devices in Old English literature\nWeek 12-14: Prose and Historical Texts\nReading and analysis of Old English prose texts\nHistorical documents and their significance\nWeek 15: Final Exam Review\nResearch Project:\nStudents will choose a topic related to Old English language, literature, or culture for a research project. The project will include a written paper and an oral presentation.\nCourse Policies:\nRegular attendance is expected.\nLate assignments will be penalized.\nPlagiarism will not be tolerated and will result in severe consequences.\nNote:\nThis syllabus is subject to change at the discretion of the instructor. Students will be notified of any modifications in advance.",
    "Grade Breakdown": {
      "Homework": 0.3,
      "Midterm": 0.2,
      "Final": 0.3,
      "Research Project": 0.2
    },
    "Enrolled Students": ["1001", "1002", "1003"],
    "Assignments": {
      "HW1": {
        "Title": "Vocabulary Building Exercise",
        "Description": "To reinforce and expand your Old English vocabulary.",
        "Due Date": "2023-09-30"
      },
      "HW2": {
        "Title": "Translation Practice - Beowulf Excerpt",
        "Description": "To enhance your translation skills and understanding of Old English syntax.",
        "Due Date": "2023-10-30"
      },
      "HW3": {
        "Title": "Literary Analysis of Old English Poetry",
        "Description": "To develop your skills in literary analysis and interpretation of Old English poetry.",
        "Due Date": "2023-12-15"
      }
    },
    "Grades": {
      "HW1": {
        "1001": 0.95,
        "1002": 0.75,
        "1003": 0.85
      },
      "HW2": {
        "1001": 1,
        "1002": 0.83,
        "1003": 0.84
      },
      "HW3": {},
      "Midterm": {
        "1001": 0.9,
        "1002": 0.5,
        "1003": 0.8
      }
    },
    "Exams": {
      "Midterm": {
        "Date": "2023-11-01"
      },
      "Final": {
        "Date": "2023-12-20"
      }
    }
  }